package ee.homeproject.first;

/*Создайте метод printThreeWords(), который при вызове должен отпечатать в столбец три слова: Orange, Banana, Apple.
Orange
Banana
Apple
 */

public class FirstApp {
        // Aleksei Faraon
        // 2.Создайте метод printThreeWords(), который при вызове должен отпечатать в столбец три слова: Orange, Banana, Apple.
    public static void printThreeWords(String [] args){
        System.out.println("Hello, this is my first step in Java...");
        System.out.println("Orange");
        System.out.println("Banana");
        System.out.println("Apple");
        }
    }











